# Q1).

In [1]:
import pandas as pd
from scipy import stats
from scipy.stats import chi2_contingency

In [16]:
Cutlet=pd.read_csv('cutlets.csv')
Cutlet

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [18]:
column_mapping={'Unit A' : 'unitA'}

In [22]:
Cutlet.rename(columns=column_mapping, inplace=True)

In [23]:
Cutlet

     unitA   unitB
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [29]:
unit_a=pd.Series(Cutlet.unitA)

In [30]:
unit_a

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: unitA, dtype: float64

In [21]:
column_mapping={'Unit B' : 'unitB'}

In [24]:
unit_b=pd.Series(Cutlet.unitB)

In [25]:
unit_b

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: unitB, dtype: float64

In [32]:
stats.ttest_ind(unit_a,unit_b)

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [ ]:
#we made two hypothesis that Ho and Ha ,Ho says there is no significance in diameter and Ha says that there is difference in diameter
#level of significance is 5% = 0.05
#since pvalue is greater than alpha (l.o.s) we failed to reject Ho

# Q2).

In [2]:
tat=pd.read_csv('LabTAT.csv')

In [3]:
tat

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [13]:
column_mapping={'Laboratory 1' : 'lab1'}

In [17]:
column_mapping={'Laboratory 2' : 'lab2'}

In [15]:
column_mapping={'Laboratory 3' : 'lab3'}

In [19]:
column_mapping={'Laboratory 4' : 'lab4'}

In [18]:
tat.rename(columns=column_mapping, inplace=True)

tat

       lab1    lab2    lab3    lab4
0    185.35  165.53  176.70  166.13
1    170.49  185.91  198.45  160.79
2    192.77  194.92  201.23  185.18
3    177.33  183.00  199.61  176.42
4    193.41  169.57  204.63  152.60
..      ...     ...     ...     ...
115  178.49  170.66  193.80  172.68
116  176.08  183.98  215.25  177.64
117  202.48  174.54  203.99  170.27
118  182.40  197.18  194.52  150.87
119  182.09  215.17  221.49  162.21

[120 rows x 4 columns]

In [20]:
Lab1=pd.Series(tat.lab1)

In [21]:
Lab2=pd.Series(tat.lab2)
Lab3=pd.Series(tat.lab3)
Lab4=pd.Series(tat.lab4)

In [22]:
Lab1

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: lab1, Length: 120, dtype: float64

In [23]:
Lab2

0      165.53
1      185.91
2      194.92
3      183.00
4      169.57
        ...
115    170.66
116    183.98
117    174.54
118    197.18
119    215.17
Name: lab2, Length: 120, dtype: float64

In [24]:
Lab3

0      176.70
1      198.45
2      201.23
3      199.61
4      204.63
        ...
115    193.80
116    215.25
117    203.99
118    194.52
119    221.49
Name: lab3, Length: 120, dtype: float64

In [25]:
Lab4

0      166.13
1      160.79
2      185.18
3      176.42
4      152.60
        ...
115    172.68
116    177.64
117    170.27
118    150.87
119    162.21
Name: lab4, Length: 120, dtype: float64

In [26]:
Lab1.mean(),Lab2.mean(),Lab3.mean(),Lab4.mean()

(178.36158333333339, 178.9029166666668, 199.91325000000003, 163.6827499999999)

In [27]:
stats.f_oneway(Lab1,Lab2,Lab3,Lab4)

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [ ]:
#Null Hypothesis (H0): There is no difference in the average Turn Around Time (TAT) among the different laboratories.
#Alternative Hypothesis (Ha): There is a significant difference in the average Turn Around Time (TAT) among the different laboratories.

In [ ]:
# alpha =0.05 since pvalue is greater than alpha we failed to reject null hypothesis

# Q3).

In [30]:
BR=pd.read_csv('BuyerRatio.csv')
BR

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [34]:
br=[[50,142,131,70],
    [435,1523,1356,750]]
br

[[50, 142, 131, 70], [435, 1523, 1356, 750]]

In [35]:
pd.DataFrame(br,
            index=['Males','Females'],
            columns=['East','West','North','South'])

         East  West  North  South
Males      50   142    131     70
Females   435  1523   1356    750

In [37]:
chi2_contingency(br)

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
        [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [ ]:
#Ho = all proportion are equal and Ha=not all proportion are equal and alpha=0.05
#since pvalue(0.66)is greater than alpha we failed to reject null hypothesis

# Q4).

In [3]:
ocf=pd.read_csv('Costomer+OrderForm.csv')
ocf

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [13]:
ocf.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [14]:
ocf.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [15]:
ocf.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [16]:
ocf.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [18]:
OCF=[[271,263,269,280],
     [29,33,31,20]]
OCF

[[271, 263, 269, 280], [29, 33, 31, 20]]

In [19]:
pd.DataFrame(OCF,
            index=['Error_free','Defective'],
            columns=['Phillippines','Indonesia','Malta','India'])

            Phillippines  Indonesia  Malta  India
Error_free           271        263    269    280
Defective             29         33     31     20

In [21]:
chi2_contingency(OCF)

(4.004831088534666,
 0.26094293199269114,
 3,
 array([[271.65551839, 268.03344482, 271.65551839, 271.65551839],
        [ 28.34448161,  27.96655518,  28.34448161,  28.34448161]]))

In [ ]:
#Ho=There is no association between the center and the defective order forms.
#Ha=There is an association between the center and the defective order forms.

In [ ]:
#pvalue=0.260 and alpha=0.05 since pvalue is greater than alpha we failed to reject null hypothesis